000100* HELLO.COB GNU Cobol FAQ example
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. hello.
      *
000301 ENVIRONMENT     DIVISION.
       INPUT-OUTPUT    SECTION.
       FILE-CONTROL.
       SELECT  OUT-FL       ASSIGN  "outfile.dat".
      *    
000310 DATA DIVISION.
000320*   WORKING-STORAGE SECTION.
       FILE SECTION.
       FD  OUT-FL DATA RECORD
000330*
000400 PROCEDURE DIVISION.
       MAIN SECTION.
       OPEN OUTPUT OUT-FL.
       WRITE "HELLO WORLD!".
       CLOSE OUT-FL.
000600 STOP RUN.
